demo0/Coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    low
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9;
        startFace       229;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14;
        startFace       238;
    }
    rifht
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14;
        startFace       252;
    }
    up
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9;
        startFace       266;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          252;
        startFace       275;
    }
)

// ************************************************************************* //
