demo0/Coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   low
    {
        type            fixedValue;
        value           nonuniform List<vector> 
9
(
(0 0.20987634567900001 0)
(0 0.555555111111 0)
(0 0.8024695308640001 0)
(0 0.950617382716 0)
(0 1.0 0)
(0 0.9506182716000001 0)
(0 0.8024730864000003 0)
(0 0.5555511111000001 0)
(0 0.20987456790000017 0)
)
;
    }

    rifht
    {
        type            noSlip;
    }

    up
    {
        type            zeroGradient;
    }

    left
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
