demo0/Coarse/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
126
(
0.0102618
0.00946385
0.00847311
0.00578655
0.0012093
-0.00879478
0.0326208
0.0321887
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<scalar> 9(0.0111111 0.0333333 0.0555556 0.0777778 0.1 0.122222 0.144444 0.166667 0.188889);
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
14
(
-0.000878446
-0.00185762
-0.00310973
-0.00600515
-0.0107664
-0.0214587
-0.0390053
-0.0560002
-0.0603413
-0.0497654
-0.0349685
-0.0209398
-0.00538308
0.0141123
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<scalar> 
14
(
0.200377
0.202715
0.206246
0.20711
0.20573
0.208708
0.214921
0.219507
0.223075
0.225572
0.226314
0.223962
0.225202
0.233693
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 9(0.0380678 0.064031 0.0898812 0.11547 0.140604 0.165007 0.188303 0.210018 0.22961);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
