demo0/Coarse/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
126
(
0.0142575
0.0427595
0.0712254
0.0995492
0.127685
0.153929
0.0139638
0.0418574
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           uniform 0;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
14
(
0.0143776
0.0431593
0.0719217
0.100578
0.128962
0.155236
0.180195
0.207448
0.237829
0.267858
0.294259
0.318785
0.342302
0.362471
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<scalar> 
14
(
0.0116075
0.0346621
0.057616
0.080715
0.103901
0.12652
0.143641
0.156032
0.168758
0.181731
0.198213
0.217859
0.236916
0.254789
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 9(0.367603 0.359985 0.351998 0.343217 0.333229 0.321585 0.307884 0.291815 0.273235);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
