demo0/Coarse/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
126
(
0
5.96983e-21
1.81149e-19
-3.59612e-19
1.75749e-19
0
-4.74572e-19
9.08997e-20
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           uniform 0;
    }
    left
    {
        type            calculated;
        value           uniform 0;
    }
    rifht
    {
        type            calculated;
        value           uniform 0;
    }
    up
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
