demo0/Coarse/0/HanGaoBCFaceVector
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      HanGaoBCFaceVector;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<vector> 9((0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0) (0 -0.000212724 0));
    }
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
14
(
(-0.000275261 -1.6818e-05 0)
(-0.000275768 -1.92845e-06 0)
(-0.000274892 -2.20434e-05 3.38813e-21)
(-0.000273746 -3.33897e-05 3.38813e-21)
(-0.000269656 -5.77652e-05 6.77626e-21)
(-0.000233369 -0.00014694 1.35525e-20)
(-0.000244467 -0.000188992 0)
(-0.00027731 -0.000136377 1.35525e-20)
(-0.000304331 5.32673e-05 0)
(-0.000270571 0.00014921 1.35525e-20)
(-0.000234892 0.000134077 0)
(-0.000234654 0.000134505 0)
(-0.000215581 0.00016333 0)
(-0.000170553 0.000209911 1.35525e-20)
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<vector> 
14
(
(0.000222228 -7.21698e-06 -8.47033e-22)
(0.000219155 -3.75375e-05 0)
(0.000220301 -3.00722e-05 3.38813e-21)
(0.000221931 1.35264e-05 0)
(0.00022197 1.28952e-05 0)
(0.00021107 -6.98984e-05 -6.77626e-21)
(0.000116711 -4.90541e-05 0)
(0.000120524 -3.87525e-05 1.69407e-21)
(0.000123105 -2.95473e-05 0)
(0.000125277 -1.82646e-05 8.47033e-22)
(0.000190269 4.06823e-06 4.23516e-22)
(0.000185856 4.09437e-05 0)
(0.000178988 -6.46659e-05 0)
(0.000163195 -9.79103e-05 0)
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 9((7.22934e-05 0.00024872 0) (7.35559e-05 0.000248349 0) (7.93633e-05 0.000246555 0) (8.87371e-05 0.000243338 6.77626e-21) (0.000102499 0.000237869 1.35525e-20) (0.000120426 0.000229315 0) (0.000141875 0.000216701 0) (0.000165765 0.000199023 0) (0.000189956 0.000176081 0));
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
