demo0/Coarse/0/S
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<symmTensor> 
126
(
(0 0 0 -34.9439 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 -35.6752 0 0)
(0 0 0 0 0 0)
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<symmTensor> 9((0 0 0 -70.1384 0 0) (0 0 0 -71.6137 0 0) (0 0 0 -73.1698 0 0) (0 0 0 -74.815 0 0) (0 0 0 -76.559 0 0) (0 0 0 -78.4125 0 0) (0 0 0 -80.3882 0 0) (0 0 0 -82.5004 0 0) (0 0 0 -84.7653 0 0));
    }
    left
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
14
(
(0 1.06353 0 -34.8139 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
14
(
(0 -0.684499 0 -42.1546 2.60901e-18 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
)
;
    }
    up
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
