demo0/Coarse/0/div(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      div(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
126
(
(0 2348.85 0)
(0 -0.855884 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 2569.57 0)
(0 -0.697132 0)
...
)
;

boundaryField
{
    low
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 9((0 2348.85 0) (0 2569.57 0) (0 2682.35 0) (0 2804.21 0) (0 2936.31 0) (0 3080.03 0) (0 3236.97 0) (0 3409.03 0) (0 3564.99 0));
    }
    left
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
14
(
(0 2348.85 0)
(0 -0.855884 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
)
;
    }
    rifht
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
14
(
(0 3564.99 0)
(0 1.62897 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
)
;
    }
    up
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
